tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "martindelille/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "rbenv/tap"
tap "weaveworks/tap"
brew "autoconf"
brew "coreutils"
brew "openssl@1.1"
brew "asdf"
brew "avrdude"
brew "awscli"
brew "awsume"
brew "bootloadhid"
brew "clang-format"
brew "ctags"
brew "dfu-programmer"
brew "dfu-util"
brew "docker-compose", link: false
brew "docker-machine"
brew "doctl"
brew "fortune"
brew "fzf"
brew "gh"
brew "git"
brew "git-extras"
brew "git-flow"
brew "pinentry"
brew "gnupg"
brew "jenkins-lts", restart_service: true
brew "jq"
brew "kubectx"
brew "legit"
brew "lolcat"
brew "navi"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "packer"
brew "pinentry-mac"
brew "postgresql", restart_service: true
brew "sl"
brew "telnet"
brew "the_silver_searcher"
brew "tmux"
brew "trash"
brew "tree"
brew "unzip"
brew "wget"
brew "wxmac"
brew "osx-cross/arm/arm-gcc-bin@8", link: true
brew "osx-cross/avr/avr-gcc@8"
brew "weaveworks/tap/eksctl"
cask "adoptopenjdk8"
cask "arduino"
cask "brave-browser"
cask "dash"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "google-chrome-canary"
cask "inkscape"
cask "keybase"
cask "mattermost"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "postman"
cask "slack"
cask "telegram"
cask "vagrant"
cask "virtualbox"
cask "xquartz"
