tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jason0x43/neovim-nightly"
tap "jesseduffield/lazygit"
tap "mike-engel/jwt-cli"
tap "turbot/tap"
brew "ansible"
brew "jpeg-xl"
brew "aom"
brew "coreutils"
brew "asdf"
brew "boost"
brew "python@3.9"
brew "csvkit"
brew "curl"
brew "difftastic"
brew "folly"
brew "edencommon"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "fd"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "git"
brew "gnu-sed"
brew "unbound"
brew "gnutls"
brew "pinentry"
brew "gnupg"
brew "python@3.10"
brew "netpbm"
brew "graphviz"
brew "hugo"
brew "jless"
brew "oniguruma"
brew "jq"
brew "kubectx"
brew "lastpass-cli"
brew "lua-language-server"
brew "luarocks"
brew "neovim"
brew "nmap"
brew "pinentry-mac"
brew "postgresql@14"
brew "ripgrep"
brew "stow"
brew "telnet"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "ugrep"
brew "watchman"
brew "wget"
brew "yarn"
brew "zellij"
brew "zsh-completions"
brew "hashicorp/tap/terraform-ls"
brew "jesseduffield/lazygit/lazygit"
brew "turbot/tap/steampipe"
cask "docker"
cask "emacs"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "google-chrome-canary"
cask "insomnia"
cask "iterm2"
cask "keepassx"
cask "lens"
cask "mattermost"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-office"
cask "pgadmin4"
cask "postman"
